import { Random } from 'mockjs';
import { BlogAbstractProto, BlogListProto } from '../blog-list.proto';

export const createFakeBlog = (): BlogAbstractProto => ({
  id: Random.word(10),
  title: Random.csentence(5, 10),
  abstract: Random.cparagraph(7, 14),
  time: '1999年02月02日',
});

export const fakeBlogList: BlogListProto = {
  currentPage: 1,
  totalPage: 1,
  blogAbstracts: [
    {
      id: 'nxwmhmiild',
      title: '造山使车划红规拉面。',
      abstract:
        '个要织眼他南认设参南区县构。义力系地更无证红而他解无。太江素经定确铁持提群明局查张养形水。书油领调角张任走科段水设东。算会也再更些文白些民育书只。身业直段往更油思生两制况。机作平干名计属影公两又为反二的老。',
      time: '1999年02月02日',
    },
    {
      id: 'ynnvwksyix',
      title: '改百力各到理快。',
      abstract:
        '育张边过族单事或代员位海例改大形很。加以众社采也先水说器期太收么利命。例取风反其活支划图响派更口。回国后入点色九验着厂八本也。造金转或据百安引向等装层明。老节动西主布接类响报进器业长争农资。它任火交我示级许着圆联常料常须家能。研验制向化看常劳度行养具细支军常外。',
      time: '1999年02月02日',
    },
    {
      id: 'zpalimnscj',
      title: '却达都导矿理队全体。',
      abstract:
        '派还许她备走须根精整大气务资样易。细队织影飞它四复切拉历那改清精人。验切七铁例么回适合党于立石住革。真并员分八记一即物口习利过越。在第解江又满因按集音影同各。经下拉知商行革管话务分容识象。常革值新七省得没总类也取火这经安被起。平己需个物且各水力法中平。离青意龙长九传无西识斯团身型使题。',
      time: '1999年02月02日',
    },
    {
      id: 'kffqqstgms',
      title: '王处利题党外最。',
      abstract:
        '门十石土属由白才格种影带段如造。格军格断场见算毛一当主者手克。身积温准格速花织我关适象空。万他我接研件红置类收有红维属。观联即走总想矿统算温统情目内看传结。本方用段究导革型响原分米准建先。就观那价点天所两题府运县气这保之第。听红没角传心转集记阶近单叫中度来。件山受理关那解油表花没很传。十准精条光八共团日单且应按于可权。县报把事期工音利离一间开者马。观术作太条以际二或代劳图这据。人听只于受元就少天那场四毛快京。',
      time: '1999年02月02日',
    },
    {
      id: 'letihdnlng',
      title: '往术住见结头及道取还。',
      abstract:
        '主即员定题发县研许属火定员家火级称了。做积与志半从给导况其回音。听意九同石运事东者眼观广矿。多集最感生北方及东步安当今第。现和风学原志育性圆构究花林分。特集国数即其五名步六将象把。分离线了好里什到山确你解门该信反相。行如满每道行门众西料必面象号层。确究京始但便许但手程六满权。活或开用积克党证单北些选素化治过。约把油无即应专个科直示日无联府。',
      time: '1999年02月02日',
    },
    {
      id: 'dmsfgicnpr',
      title: '想油王最题公南每难。',
      abstract:
        '林最术但美现手指例何种成。由改置金着养全自命满党资才。音军件市心走品已出切门价定计斯很备县。象队发除当动各四值提系己层。难华级好事农解对给办消义片因。展酸历等然边手身基部容话节没。线出常酸有极近比工无名四效元响性技。而米要起群料党千族温准机先听。矿及石严实领半志行着合片华。七白动务是车律务事教他便九革可布观。法后强变亲上被连争育完器果。自制线去科水张且东北基会要当容研却明。文包劳期文能合门为单从体性六。则压特斗速美光在必验八规十车持。',
      time: '1999年02月02日',
    },
    {
      id: 'admzutujki',
      title: '特观群飞府所因到。',
      abstract:
        '得斗目我百认效县百加头着价做较。安速阶前点江好将七分期次你学真信员况。资受值已克江但对须了适空议参使我住。大命计动领元县说与总何中单较平。满流确阶于满分把的观安品际适。内转一从部热书持格物目参规少难。太面把果作自个路感定的即名。政往记例许系战子直理第必手重。状被律育总给它层领族山展步越。权适车当统消局象产党况转却。相酸入世因接府求价今明劳用入近。才土家节论品学老青始矿联先议。连型处手记走共前据且任劳她。支八消叫品整西划向深江完取观。',
      time: '1999年02月02日',
    },
    {
      id: 'huyvocigpd',
      title: '使斗安增议车展强。',
      abstract:
        '价月准况大业王新一比更资张中自那使。件程信求达见按会论后队京眼必指。信军总就例先王质世空验程体者。头从东感林质能认圆些口长酸内矿正义料。国观得维六区线设效极林总认老。农队委斗军样速时交部以往该族联。律些事员海化义各向来么住实得离究。象众程划解界族治线车算太示油使。克斗九领比美想度积以自候严相至里放。等干这务儿图复放许况然料只。',
      time: '1999年02月02日',
    },
    {
      id: 'wwsujqkhjc',
      title: '将导新专何派积。',
      abstract:
        '采确现查期等完务七马道出党往支内众。种去员我决知志许公活名条。原世经越世长相除对干九术济。深社系进问采圆长该与达状情在类候并主。热专结住图作速值清写农市队。决命类至的放本你革写最众想年。外队装后员信相一对思被铁料际只成上。展与传半会天意不矿农论这位方感没。满即已一算决极种里关江你但族。',
      time: '1999年02月02日',
    },
    {
      id: 'grueuxpkjz',
      title: '热话出后领步细系门。',
      abstract:
        '体件行八院最府家持解声专华。展所传术高矿面影权每会志记命风员上。能被热院间须可基去革任见。是在引老由器道通义素时打小。温毛人存证容同问高离流基往质个当。安革任连能起指除以节子来色然况。据从便按科则到个率民比拉消号住车同。南解价着里群全把只书响布等离心越山。好大样工眼世平大走主界与段。',
      time: '1999年02月02日',
    },
  ],
};
